--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\gauta\Documents\GitHub\pandemic\graphing.log
  log type:  text
 opened on:   9 Oct 2021, 16:19:22

. 
. //generate bar charts of Hospital Beds/1000
. use "./Data/pandemic_master.dta", clear

. keep Country id dstr_WHO dstr_WHO2 WB_hb_p1000

. drop if dstr_WHO ==.
(261 observations deleted)

. drop if WB_hb_p1000==.
(1 observation deleted)

. 
. set scheme plottig

. graph bar WB_hb_p1000, over(id, sort(1) label(angle(90))) title({bf: Hospital Beds per 1000:} {it: A Cross-Country Comparison}, size(8pt)) ytitle("Hospital Beds per 100
> 0")

. 
. graph save "C:/Users/gauta/Documents/GitHub/pandemic/figures/xvars/pres_bar_1.gph", replace
(file C:/Users/gauta/Documents/GitHub/pandemic/figures/xvars/pres_bar_1.gph saved)

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. //generate bar charts of Health Expenditure as % of GDP
. use "./Data/pandemic_master.dta", clear

. keep Country id dstr_WHO dstr_WHO2 WHO_2018_HE_GDP

. drop if dstr_WHO ==.
(261 observations deleted)

. drop if WHO_2018_HE_GDP==.
(1 observation deleted)

. 
. set scheme plottig

. graph bar WHO_2018_HE_GDP, over(id, sort(1) label(angle(90))) title({bf: Health Expenditure as % of GDP:} {it: A Cross-Country Comparison}, size(8pt)) ytitle("Health Ex
> penditure (% of GDP)")

. 
. graph save "C:/Users/gauta/Documents/GitHub/pandemic/figures/xvars/pres_bar_2.gph", replace
(file C:/Users/gauta/Documents/GitHub/pandemic/figures/xvars/pres_bar_2.gph saved)

. 
end of do-file

. exit, clear
