--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\gauta\Documents\GitHub\pandemic\pandemic.log
  log type:  text
 opened on:  19 Sep 2021, 11:42:06

. 
. *Analysis 1: Regressing GHSI_Overall on stock_1/stock_WHO2 (daily stock data from Investing.com). (12/09/21)
. use "./Data/pandemic.dta", clear

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
. //GHSI DATA (X1a)
. import excel "./GHSI_2019_data.xlsx", sheet("Sheet2") firstrow clear
(20 vars, 196 obs)

. drop J K L M N O P Q R S T U

. 
. rename Overall GHSI_Overall

. rename D GHSI_prev

. rename E GHSI_det

. rename F GHSI_resp

. rename G GHSI_hea_sec

. rename H GHSI_commit

. rename I GHSI_risk

. 
. save ghsi.dta, replace
file ghsi.dta saved

. 
. //looking for outliers/inspecting data
. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     Country |          0
GHSI_Overall |        196        40.2    14.47817       16.2       83.5
   GHSI_prev |        196     34.7551    16.87089        1.9       83.1
    GHSI_det |        196    41.88469    23.75211        2.7       98.2
   GHSI_resp |        196    38.43418    15.08093       11.3       91.9
-------------+---------------------------------------------------------
GHSI_hea_sec |        196    26.42755    16.83055         .3       73.8
 GHSI_commit |        196    48.48469    12.60972       23.3       85.3
   GHSI_risk |        196    55.03112    16.16126       15.9       87.9

. inspect 

Country:  Country                               Number of Observations
-----------------                      ---------------------------------------
                                             Total      Integers   Nonintegers
|                            Negative            -             -             -
|                            Zero                -             -             -
|                            Positive            -             -             -
|                                      -----------   -----------   -----------
|                            Total               -             -             -
|                            Missing           196
+----------------------                -----------
.             -9.0e+307                        196
   (0 unique value)

GHSI_Overall:  Overall                          Number of Observations
----------------------                 ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|  #   #                     Positive          196            23           173
|  #   #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            23           173
|  #   #   #   #   .         Missing             -
+----------------------                -----------
16.2               83.5                        196
(More than 99 unique values)

GHSI_prev:  1                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|      #                     Positive          196            30           166
|      #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            30           166
|  #   #   #   #   .         Missing             -
+----------------------                -----------
1.9                83.1                        196
(More than 99 unique values)

GHSI_det:  2                                    Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #   #                 Zero                -             -             -
|  #   #   #                 Positive          196            28           168
|  #   #   #   #                       -----------   -----------   -----------
|  #   #   #   #             Total             196            28           168
|  #   #   #   #   #         Missing             -
+----------------------                -----------
2.7                98.2                        196
(More than 99 unique values)

GHSI_resp:  3                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|  #   #   #                 Positive          196            18           178
|  #   #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            18           178
|  #   #   #   #   .         Missing             -
+----------------------                -----------
11.3               91.9                        196
(More than 99 unique values)

GHSI_hea_sec:  4                                Number of Observations
----------------                       ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #   #                     Zero                -             -             -
|  #   #                     Positive          196            24           172
|  #   #   #                           -----------   -----------   -----------
|  #   #   #   #             Total             196            24           172
|  #   #   #   #   #         Missing             -
+----------------------                -----------
.3                 73.8                        196
(More than 99 unique values)

GHSI_commit:  5                                 Number of Observations
---------------                        ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|      #   #                 Zero                -             -             -
|      #   #                 Positive          196            22           174
|  #   #   #                           -----------   -----------   -----------
|  #   #   #   #             Total             196            22           174
|  #   #   #   #   .         Missing             -
+----------------------                -----------
23.3               85.3                        196
(More than 99 unique values)

GHSI_risk:  6                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|          #                 Zero                -             -             -
|      #   #   #             Positive          196            21           175
|      #   #   #                       -----------   -----------   -----------
|      #   #   #   #         Total             196            21           175
|  #   #   #   #   #         Missing             -
+----------------------                -----------
15.9               87.9                        196
(More than 99 unique values)

. 
. //STOCK MARKET DATA (Y)
. 
. *stock market data from Investing.com
. import excel "./stockdata/stockfluctuations_1.xlsx", firstrow clear
(7 vars, 195 obs)

. save fluctuations_investing.dta, replace
(note: file fluctuations_investing.dta not found)
file fluctuations_investing.dta saved

. 
. *Datastream data - For Loop generating % change between 06/03 and 13/03
. import delimited "./stockdata/DataStream/stock_ts.csv", firstrow clear
option firstrow not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import delimited "./stockdata/DataStream/stock_ts.csv", clear
file ./stockdata/DataStream/stock_ts.csv not found
r(601);

end of do-file

r(601);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import delimited "./stockdata/DataStream/stock_ts.csv", clear
file ./stockdata/DataStream/stock_ts.csv not found
r(601);

end of do-file

r(601);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
. //GHSI DATA (X1a)
. import excel "./GHSI_2019_data.xlsx", sheet("Sheet2") firstrow clear
(20 vars, 196 obs)

. drop J K L M N O P Q R S T U

. 
. rename Overall GHSI_Overall

. rename D GHSI_prev

. rename E GHSI_det

. rename F GHSI_resp

. rename G GHSI_hea_sec

. rename H GHSI_commit

. rename I GHSI_risk

. 
. save ghsi.dta, replace
file ghsi.dta saved

. 
. //looking for outliers/inspecting data
. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     Country |          0
GHSI_Overall |        196        40.2    14.47817       16.2       83.5
   GHSI_prev |        196     34.7551    16.87089        1.9       83.1
    GHSI_det |        196    41.88469    23.75211        2.7       98.2
   GHSI_resp |        196    38.43418    15.08093       11.3       91.9
-------------+---------------------------------------------------------
GHSI_hea_sec |        196    26.42755    16.83055         .3       73.8
 GHSI_commit |        196    48.48469    12.60972       23.3       85.3
   GHSI_risk |        196    55.03112    16.16126       15.9       87.9

. inspect 

Country:  Country                               Number of Observations
-----------------                      ---------------------------------------
                                             Total      Integers   Nonintegers
|                            Negative            -             -             -
|                            Zero                -             -             -
|                            Positive            -             -             -
|                                      -----------   -----------   -----------
|                            Total               -             -             -
|                            Missing           196
+----------------------                -----------
.             -9.0e+307                        196
   (0 unique value)

GHSI_Overall:  Overall                          Number of Observations
----------------------                 ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|  #   #                     Positive          196            23           173
|  #   #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            23           173
|  #   #   #   #   .         Missing             -
+----------------------                -----------
16.2               83.5                        196
(More than 99 unique values)

GHSI_prev:  1                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|      #                     Positive          196            30           166
|      #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            30           166
|  #   #   #   #   .         Missing             -
+----------------------                -----------
1.9                83.1                        196
(More than 99 unique values)

GHSI_det:  2                                    Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #   #                 Zero                -             -             -
|  #   #   #                 Positive          196            28           168
|  #   #   #   #                       -----------   -----------   -----------
|  #   #   #   #             Total             196            28           168
|  #   #   #   #   #         Missing             -
+----------------------                -----------
2.7                98.2                        196
(More than 99 unique values)

GHSI_resp:  3                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|  #   #   #                 Positive          196            18           178
|  #   #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            18           178
|  #   #   #   #   .         Missing             -
+----------------------                -----------
11.3               91.9                        196
(More than 99 unique values)

GHSI_hea_sec:  4                                Number of Observations
----------------                       ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #   #                     Zero                -             -             -
|  #   #                     Positive          196            24           172
|  #   #   #                           -----------   -----------   -----------
|  #   #   #   #             Total             196            24           172
|  #   #   #   #   #         Missing             -
+----------------------                -----------
.3                 73.8                        196
(More than 99 unique values)

GHSI_commit:  5                                 Number of Observations
---------------                        ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|      #   #                 Zero                -             -             -
|      #   #                 Positive          196            22           174
|  #   #   #                           -----------   -----------   -----------
|  #   #   #   #             Total             196            22           174
|  #   #   #   #   .         Missing             -
+----------------------                -----------
23.3               85.3                        196
(More than 99 unique values)

GHSI_risk:  6                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|          #                 Zero                -             -             -
|      #   #   #             Positive          196            21           175
|      #   #   #                       -----------   -----------   -----------
|      #   #   #   #         Total             196            21           175
|  #   #   #   #   #         Missing             -
+----------------------                -----------
15.9               87.9                        196
(More than 99 unique values)

. 
. //STOCK MARKET DATA (Y)
. 
. *stock market data from Investing.com
. import excel "./stockdata/stockfluctuations_1.xlsx", firstrow clear
(7 vars, 195 obs)

. save fluctuations_investing.dta, replace
file fluctuations_investing.dta saved

. 
. *Datastream data - For Loop generating % change between 06/03 and 13/03
. import delimited "./stockdata/DataStream/data/stock_ts.csv", clear
(4 vars, 485 obs)

. 
. 
. 
. merge 1:1 Country using ghsi.dta
variable Country not found
r(111);

end of do-file

r(111);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import delimited "./stockdata/DataStream/data/stock_ts.csv", clear
(4 vars, 485 obs)

. 
end of do-file

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          v1 |          0
          v2 |          0
          v3 |          0
          v4 |          0

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import delimited "./stockdata/DataStream/data/stock_ts.csv", varnames(1) clear
(4 vars, 484 obs)

. 
end of do-file

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ïcountry |          0
       index |          0
        week |          0
closingprice |          0

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. rename  ïcountry country

. 
end of do-file

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     country |          0
       index |          0
        week |          0
closingprice |          0

. tab
varlist required
r(100);

. tab closingprice

    Closing |
      Price |      Freq.     Percent        Cum.
------------+-----------------------------------
       0.15 |          3        0.62        0.62
       0.16 |          3        0.62        1.24
       0.17 |          6        1.24        2.48
       0.18 |          3        0.62        3.11
       0.19 |          3        0.62        3.73
        0.2 |          4        0.83        4.55
   1,732.22 |          1        0.21        4.76
   1,735.51 |          1        0.21        4.97
   1,786.73 |          1        0.21        5.18
   1,801.25 |          1        0.21        5.38
   1,809.90 |          1        0.21        5.59
   1,832.17 |          1        0.21        5.80
   1,903.92 |          1        0.21        6.00
   1,906.40 |          1        0.21        6.21
   1,917.98 |          1        0.21        6.42
   1,956.54 |          1        0.21        6.63
   1,962.77 |          1        0.21        6.83
   1,980.00 |          1        0.21        7.04
  10,113.01 |          1        0.21        7.25
  10,221.63 |          1        0.21        7.45
  10,225.49 |          1        0.21        7.66
  10,289.29 |          1        0.21        7.87
  10,323.82 |          1        0.21        8.07
  10,333.52 |          1        0.21        8.28
  10,405.85 |          1        0.21        8.49
  10,417.31 |          1        0.21        8.70
  10,600.49 |          1        0.21        8.90
  10,895.30 |          1        0.21        9.11
  10,910.55 |          1        0.21        9.32
  10,942.88 |          1        0.21        9.52
  11,286.36 |          1        0.21        9.73
  11,353.34 |          1        0.21        9.94
  11,380.21 |          1        0.21       10.14
  11,409.65 |          1        0.21       10.35
  11,445.12 |          1        0.21       10.56
  11,448.54 |          1        0.21       10.77
  11,471.72 |          1        0.21       10.97
  11,481.39 |          1        0.21       11.18
  11,529.64 |          1        0.21       11.39
  11,559.67 |          1        0.21       11.59
  11,738.78 |          1        0.21       11.80
  12,069.01 |          1        0.21       12.01
  12,207.63 |          1        0.21       12.22
  12,217.22 |          1        0.21       12.42
  13,269.19 |          1        0.21       12.63
  13,863.61 |          1        0.21       12.84
  14,432.39 |          1        0.21       13.04
  14,443.88 |          1        0.21       13.25
  14,452.07 |          1        0.21       13.46
  14,750.00 |          1        0.21       13.66
  14,840.67 |          1        0.21       13.87
  15,045.26 |          1        0.21       14.08
  15,057.65 |          1        0.21       14.29
  15,072.08 |          1        0.21       14.49
  15,236.77 |          1        0.21       14.70
  15,474.82 |          1        0.21       14.91
  15,516.96 |          1        0.21       15.11
  15,541.01 |          1        0.21       15.32
  16,233.46 |          1        0.21       15.53
  16,360.76 |          1        0.21       15.73
     169.95 |          1        0.21       15.94
  17,989.05 |          1        0.21       16.15
  17,990.91 |          1        0.21       16.36
     171.47 |          1        0.21       16.56
     174.07 |          1        0.21       16.77
     178.52 |          1        0.21       16.98
     179.12 |          1        0.21       17.18
     179.43 |          1        0.21       17.39
  18,164.88 |          1        0.21       17.60
  18,906.04 |          1        0.21       17.81
     180.63 |          1        0.21       18.01
     181.39 |          1        0.21       18.22
     182.89 |          2        0.41       18.63
     185.44 |          1        0.21       18.84
  19,529.29 |          1        0.21       19.05
  19,969.55 |          1        0.21       19.25
     193.84 |          1        0.21       19.46
     195.35 |          1        0.21       19.67
   2,006.98 |          1        0.21       19.88
   2,029.89 |          1        0.21       20.08
   2,040.37 |          1        0.21       20.29
   2,208.40 |          1        0.21       20.50
   2,214.38 |          1        0.21       20.70
   2,240.45 |          1        0.21       20.91
   2,262.33 |          1        0.21       21.12
   2,264.20 |          1        0.21       21.33
   2,278.20 |          1        0.21       21.53
   2,293.79 |          1        0.21       21.74
   2,299.82 |          1        0.21       21.95
   2,304.38 |          1        0.21       22.15
   2,361.42 |          1        0.21       22.36
   2,365.90 |          1        0.21       22.57
   2,397.11 |          1        0.21       22.77
   2,429.68 |          1        0.21       22.98
   2,443.75 |          1        0.21       23.19
   2,466.23 |          1        0.21       23.40
   2,472.11 |          1        0.21       23.60
   2,500.47 |          1        0.21       23.81
   2,518.68 |          1        0.21       24.02
   2,520.24 |          1        0.21       24.22
   2,522.25 |          1        0.21       24.43
   2,546.03 |          1        0.21       24.64
   2,559.68 |          1        0.21       24.84
   2,560.33 |          1        0.21       25.05
   2,573.64 |          1        0.21       25.26
   2,574.84 |          1        0.21       25.47
   2,581.44 |          1        0.21       25.67
   2,583.77 |          1        0.21       25.88
   2,590.96 |          1        0.21       26.09
   2,619.94 |          1        0.21       26.29
   2,623.83 |          1        0.21       26.50
   2,633.13 |          1        0.21       26.71
   2,651.61 |          1        0.21       26.92
   2,654.87 |          1        0.21       27.12
   2,666.81 |          1        0.21       27.33
   2,671.38 |          1        0.21       27.54
   2,672.36 |          1        0.21       27.74
   2,704.25 |          1        0.21       27.95
   2,715.65 |          1        0.21       28.16
   2,722.56 |          1        0.21       28.36
   2,741.39 |          1        0.21       28.57
   2,879.66 |          1        0.21       28.78
   2,971.19 |          1        0.21       28.99
  20,128.08 |          1        0.21       29.19
  20,205.95 |          1        0.21       29.40
  20,401.89 |          1        0.21       29.61
  20,428.25 |          1        0.21       29.81
  20,454.84 |          1        0.21       30.02
  20,577.78 |          1        0.21       30.23
  20,643.15 |          1        0.21       30.43
  20,712.21 |          1        0.21       30.64
  20,779.37 |          1        0.21       30.85
     209.49 |          1        0.21       31.06
  21,593.73 |          1        0.21       31.26
  21,650.52 |          1        0.21       31.47
  21,886.14 |          1        0.21       31.68
      214.6 |          1        0.21       31.88
      226.5 |          1        0.21       32.09
     226.98 |          1        0.21       32.30
     230.58 |          1        0.21       32.51
     230.95 |          1        0.21       32.71
     231.72 |          1        0.21       32.92
     233.25 |          1        0.21       33.13
     234.98 |          1        0.21       33.33
      24.58 |          1        0.21       33.54
      24.84 |          1        0.21       33.75
     249.16 |          1        0.21       33.95
     249.31 |          1        0.21       34.16
      25.56 |          1        0.21       34.37
     252.84 |          1        0.21       34.58
     253.24 |          1        0.21       34.78
     254.23 |          1        0.21       34.99
     256.12 |          1        0.21       35.20
     257.25 |          1        0.21       35.40
     257.95 |          1        0.21       35.61
        258 |          1        0.21       35.82
      260.7 |          1        0.21       36.02
      262.1 |          1        0.21       36.23
      262.3 |          1        0.21       36.44
     265.58 |          1        0.21       36.65
     266.61 |          1        0.21       36.85
      27.24 |          1        0.21       37.06
      27.29 |          1        0.21       37.27
      27.46 |          1        0.21       37.47
     270.85 |          1        0.21       37.68
     271.59 |          1        0.21       37.89
      272.6 |          1        0.21       38.10
      273.8 |          1        0.21       38.30
     274.64 |          1        0.21       38.51
     274.68 |          1        0.21       38.72
     276.84 |          1        0.21       38.92
     276.96 |          1        0.21       39.13
     277.34 |          1        0.21       39.34
     278.15 |          1        0.21       39.54
         28 |          1        0.21       39.75
      28.19 |          1        0.21       39.96
       28.3 |          1        0.21       40.17
      28.45 |          1        0.21       40.37
      28.83 |          1        0.21       40.58
     281.92 |          1        0.21       40.79
     282.28 |          1        0.21       40.99
     283.27 |          1        0.21       41.20
     285.92 |          1        0.21       41.41
     286.99 |          1        0.21       41.61
     288.17 |          1        0.21       41.82
      29.94 |          1        0.21       42.03
        290 |          1        0.21       42.24
     290.22 |          1        0.21       42.44
     291.24 |          1        0.21       42.65
     292.42 |          1        0.21       42.86
     294.13 |          1        0.21       43.06
     294.41 |          1        0.21       43.27
     294.83 |          1        0.21       43.48
     295.58 |          1        0.21       43.69
     295.93 |          1        0.21       43.89
     296.03 |          1        0.21       44.10
     296.56 |          1        0.21       44.31
     298.29 |          1        0.21       44.51
      298.6 |          1        0.21       44.72
     299.06 |          1        0.21       44.93
   3,000.14 |          1        0.21       45.13
   3,154.49 |          1        0.21       45.34
   3,284.11 |          1        0.21       45.55
   3,374.39 |          1        0.21       45.76
   3,409.88 |          1        0.21       45.96
   3,414.52 |          1        0.21       46.17
   3,415.73 |          1        0.21       46.38
   3,474.51 |          1        0.21       46.58
   3,476.37 |          1        0.21       46.79
   3,662.54 |          1        0.21       47.00
   3,719.43 |          1        0.21       47.20
   3,725.50 |          1        0.21       47.41
   3,822.08 |          1        0.21       47.62
   3,843.76 |          1        0.21       47.83
   3,891.75 |          1        0.21       48.03
   3,914.77 |          1        0.21       48.24
   3,957.79 |          1        0.21       48.45
   3,975.04 |          1        0.21       48.65
   3,982.73 |          1        0.21       48.86
       3.18 |          1        0.21       49.07
        3.2 |          1        0.21       49.28
        3.5 |          1        0.21       49.48
       3.57 |          1        0.21       49.69
       3.81 |          1        0.21       49.90
     300.79 |          1        0.21       50.10
     301.66 |          1        0.21       50.31
     302.91 |          1        0.21       50.52
     305.49 |          1        0.21       50.72
     307.34 |          1        0.21       50.93
     308.13 |          1        0.21       51.14
     308.51 |          1        0.21       51.35
     310.36 |          1        0.21       51.55
        311 |          1        0.21       51.76
      32.13 |          1        0.21       51.97
      32.82 |          1        0.21       52.17
     321.09 |          1        0.21       52.38
     321.64 |          1        0.21       52.59
     321.87 |          1        0.21       52.80
     324.12 |          1        0.21       53.00
     325.59 |          1        0.21       53.21
     326.86 |          1        0.21       53.42
     327.55 |          1        0.21       53.62
      33.02 |          1        0.21       53.83
     333.09 |          1        0.21       54.04
      347.2 |          1        0.21       54.24
     348.68 |          1        0.21       54.45
     35.739 |          1        0.21       54.66
      35.75 |          1        0.21       54.87
     35.898 |          1        0.21       55.07
     35.931 |          1        0.21       55.28
      356.9 |          1        0.21       55.49
     358.76 |          1        0.21       55.69
     359.19 |          1        0.21       55.90
      36.38 |          1        0.21       56.11
      36.86 |          1        0.21       56.31
     363.38 |          1        0.21       56.52
     368.48 |          1        0.21       56.73
     368.83 |          1        0.21       56.94
     37.643 |          1        0.21       57.14
      37.69 |          1        0.21       57.35
      37.82 |          1        0.21       57.56
     37.975 |          1        0.21       57.76
      371.9 |          1        0.21       57.97
     372.48 |          1        0.21       58.18
     376.38 |          1        0.21       58.39
     376.86 |          1        0.21       58.59
      38.23 |          1        0.21       58.80
       38.3 |          1        0.21       59.01
      38.42 |          1        0.21       59.21
     393.18 |          1        0.21       59.42
   4,016.64 |          1        0.21       59.63
   4,221.50 |          1        0.21       59.83
   4,445.08 |          1        0.21       60.04
   4,566.42 |          1        0.21       60.25
   4,631.74 |          1        0.21       60.46
   4,879.87 |          1        0.21       60.66
       4.04 |          1        0.21       60.87
       4.05 |          1        0.21       61.08
       4.06 |          1        0.21       61.28
        4.1 |          1        0.21       61.49
       4.13 |          1        0.21       61.70
       4.27 |          1        0.21       61.90
       4.29 |          1        0.21       62.11
        4.3 |          1        0.21       62.32
       4.65 |          1        0.21       62.53
       4.87 |          1        0.21       62.73
     40.562 |          1        0.21       62.94
      40.95 |          1        0.21       63.15
     41.569 |          1        0.21       63.35
  419.85677 |          1        0.21       63.56
     42.073 |          1        0.21       63.77
      42.26 |          1        0.21       63.98
     42.323 |          1        0.21       64.18
  427.13426 |          1        0.21       64.39
     43.309 |          1        0.21       64.60
     43.423 |          1        0.21       64.80
     43.429 |          1        0.21       65.01
     43.654 |          1        0.21       65.22
  430.45387 |          1        0.21       65.42
  432.16499 |          1        0.21       65.63
     433.42 |          1        0.21       65.84
     433.54 |          1        0.21       66.05
  433.56893 |          1        0.21       66.25
  434.41898 |          1        0.21       66.46
  437.54964 |          1        0.21       66.67
  439.07526 |          1        0.21       66.87
     439.15 |          1        0.21       67.08
  439.64127 |          1        0.21       67.29
     44.237 |          1        0.21       67.49
      44.45 |          1        0.21       67.70
      44.62 |          1        0.21       67.91
  441.11227 |          1        0.21       68.12
  441.44276 |          1        0.21       68.32
  442.31556 |          1        0.21       68.53
  443.26692 |          1        0.21       68.74
  446.24729 |          1        0.21       68.94
     448.06 |          1        0.21       69.15
     45.188 |          1        0.21       69.36
  451.65966 |          1        0.21       69.57
  453.07011 |          1        0.21       69.77
  455.21962 |          1        0.21       69.98
  455.41919 |          1        0.21       70.19
   457.7333 |          1        0.21       70.39
  460.84022 |          1        0.21       70.60
   465.6847 |          1        0.21       70.81
     47.619 |          1        0.21       71.01
     47.889 |          1        0.21       71.22
     481.49 |          1        0.21       71.43
     482.79 |          1        0.21       71.64
     482.83 |          1        0.21       71.84
     493.99 |          1        0.21       72.05
   5,038.42 |          1        0.21       72.26
   5,041.30 |          1        0.21       72.46
   5,078.44 |          1        0.21       72.67
   5,118.59 |          1        0.21       72.88
   5,140.75 |          1        0.21       73.08
   5,190.78 |          1        0.21       73.29
   5,200.24 |          1        0.21       73.50
   5,366.11 |          1        0.21       73.71
   5,415.50 |          1        0.21       73.91
   5,510.33 |          1        0.21       74.12
   5,752.23 |          1        0.21       74.33
   5,763.06 |          1        0.21       74.53
   5,785.40 |          1        0.21       74.74
   5,786.60 |          1        0.21       74.95
   5,786.96 |          1        0.21       75.16
   5,799.77 |          1        0.21       75.36
   5,802.10 |          1        0.21       75.57
   5,842.66 |          1        0.21       75.78
   5,919.10 |          1        0.21       75.98
   5,926.40 |          1        0.21       76.19
   5,935.98 |          1        0.21       76.40
   5,982.90 |          1        0.21       76.60
   5,993.28 |          1        0.21       76.81
   5,997.20 |          1        0.21       77.02
       5.53 |          1        0.21       77.23
       5.56 |          1        0.21       77.43
       5.61 |          1        0.21       77.64
       5.65 |          1        0.21       77.85
       5.86 |          1        0.21       78.05
       5.91 |          1        0.21       78.26
     504.14 |          1        0.21       78.47
     508.79 |          1        0.21       78.67
      517.7 |          1        0.21       78.88
      526.8 |          1        0.21       79.09
     542.49 |          1        0.21       79.30
     548.87 |          1        0.21       79.50
562.8938533 |          1        0.21       79.71
563.8877401 |          1        0.21       79.92
583.9139657 |          1        0.21       80.12
590.6189398 |          1        0.21       80.33
   6,001.60 |          1        0.21       80.54
   6,061.80 |          1        0.21       80.75
   6,076.60 |          1        0.21       80.95
   6,081.20 |          1        0.21       81.16
   6,209.20 |          1        0.21       81.37
   6,380.20 |          1        0.21       81.57
   6,462.55 |          1        0.21       81.78
   6,484.30 |          1        0.21       81.99
   6,580.61 |          1        0.21       82.19
       6.22 |          1        0.21       82.40
621.6810602 |          1        0.21       82.61
623.8278876 |          1        0.21       82.82
627.1556964 |          1        0.21       83.02
640.8974847 |          1        0.21       83.23
643.0819931 |          1        0.21       83.44
647.7199163 |          1        0.21       83.64
660.9531434 |          1        0.21       83.85
669.4018408 |          1        0.21       84.06
 672.587356 |          1        0.21       84.27
 684.987357 |          1        0.21       84.47
   7,015.30 |          1        0.21       84.68
   7,088.89 |          1        0.21       84.89
   7,177.98 |          1        0.21       85.09
   7,244.50 |          1        0.21       85.30
   7,286.01 |          1        0.21       85.51
   7,287.76 |          1        0.21       85.71
   7,403.92 |          1        0.21       85.92
   7,409.13 |          1        0.21       86.13
   7,431.35 |          1        0.21       86.34
   7,466.70 |          1        0.21       86.54
   7,501.80 |          1        0.21       86.75
   7,509.53 |          1        0.21       86.96
   7,585.98 |          1        0.21       87.16
   7,587.85 |          1        0.21       87.37
   7,593.10 |          1        0.21       87.58
   7,674.56 |          1        0.21       87.78
   7,710.64 |          1        0.21       87.99
   7,857.76 |          1        0.21       88.20
   7,873.10 |          1        0.21       88.41
   7,944.16 |          1        0.21       88.61
   7,952.48 |          1        0.21       88.82
   7,962.96 |          1        0.21       89.03
   7,999.28 |          1        0.21       89.23
712.9859125 |          1        0.21       89.44
726.1825312 |          1        0.21       89.65
743.6049423 |          1        0.21       89.86
744.1824015 |          1        0.21       90.06
  749.95076 |          1        0.21       90.27
750.1246937 |          1        0.21       90.48
750.9689992 |          1        0.21       90.68
759.0085759 |          1        0.21       90.89
   8,013.18 |          1        0.21       91.10
   8,026.24 |          1        0.21       91.30
   8,060.80 |          1        0.21       91.51
   8,065.32 |          1        0.21       91.72
   8,094.85 |          1        0.21       91.93
   8,152.20 |          1        0.21       92.13
   8,154.34 |          1        0.21       92.34
   8,202.58 |          1        0.21       92.55
   8,204.06 |          1        0.21       92.75
   8,207.43 |          1        0.21       92.96
   8,252.30 |          1        0.21       93.17
   8,265.60 |          2        0.41       93.58
   8,268.55 |          1        0.21       93.79
   8,286.09 |          1        0.21       94.00
   8,303.30 |          1        0.21       94.20
   8,328.40 |          1        0.21       94.41
   8,351.42 |          1        0.21       94.62
   8,361.37 |          1        0.21       94.82
   8,361.74 |          1        0.21       95.03
   8,379.41 |          1        0.21       95.24
   8,397.59 |          1        0.21       95.45
   8,545.27 |          1        0.21       95.65
   8,572.60 |          1        0.21       95.86
   8,610.29 |          1        0.21       96.07
   8,614.83 |          1        0.21       96.27
   8,662.87 |          1        0.21       96.48
   8,686.82 |          1        0.21       96.69
   8,728.98 |          1        0.21       96.89
   8,759.91 |          1        0.21       97.10
   8,761.26 |          1        0.21       97.31
   8,938.82 |          1        0.21       97.52
   9,043.14 |          1        0.21       97.72
   9,236.02 |          1        0.21       97.93
   9,245.93 |          1        0.21       98.14
   9,277.66 |          1        0.21       98.34
   9,326.55 |          1        0.21       98.55
   9,350.68 |          1        0.21       98.76
   9,469.74 |          1        0.21       98.96
   9,527.28 |          1        0.21       99.17
   9,541.90 |          1        0.21       99.38
   9,913.87 |          1        0.21       99.59
   9,923.19 |          1        0.21       99.79
   9,983.17 |          1        0.21      100.00
------------+-----------------------------------
      Total |        483      100.00

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. foreach c of country {
  2.         display country
  3. }
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. foreach c of country {
  2.         display country
  3.         }
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. 
. foreach c of country {
  2.         display "country"
  3.         }
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. 
. foreach c of country {
  2.         display "c"
  3.         }
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. foreach country in country {
  2.         display "country"
  3.         }
country

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. 
. foreach country in country {
  2.         display country
  3.         }
Netherlands

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. foreach ctry in country {
  2.         display ctry
  3.         }
ctry not found
r(111);

end of do-file

r(111);

. help unique

. egen group = group(country)

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import delimited "./stockdata/DataStream/data/stock_ts.csv", varnames(1) clear
(4 vars, 484 obs)

. rename  ïcountry country

. 
. egen country_num = group(country)

. 
end of do-file

. su country_num, meanonly

. sum country_num, meanonly

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. foreach i in country_num {
  2.         gen x if i < 10
  3.         }
type mismatch
r(109);

end of do-file

r(109);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. rename  ïcountry country
variable ïcountry not found
r(111);

end of do-file

r(111);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. 
. egen country_num = group(Country)

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. egen country_num = group(Country)

. keep Country K L country_num

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. foreach i in country_num {
  2.         gen dstr_WHO = (L - K)/K
  3.         }

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. 
. foreach i in country_num {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }
variable dstr_WHO already defined
r(110);

end of do-file

r(110);

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. egen country_num = group(Country)

. keep Country K L country_num

. 
. foreach i in country_num {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. egen country_num = group(Country)

. 
. 
. keep Country K L country_num

. foreach i in Country {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import excel "./stockdata/stockfluctuations_1.xlsx", firstrow clear
(7 vars, 195 obs)

. save fluctuations_investing.dta, replace
file fluctuations_investing.dta saved

. 
. *Datastream data - For Loop generating % change between 06/03 and 13/03
. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. *generating WHO crash - can adjust this for loop in the future to generate % drop in week of first case, etc. 
. keep Country K L

. foreach i in Country {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. *stock market data from Investing.com
. import excel "./stockdata/stockfluctuations_1.xlsx", firstrow clear
(7 vars, 195 obs)

. save inv_fluctuations.dta, replace
(note: file inv_fluctuations.dta not found)
file inv_fluctuations.dta saved

. 
. *Datastream data - For Loop generating % change between 06/03 and 13/03
. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. *generating WHO crash - can adjust this for loop in the future to generate % drop in week of first case, etc. 
. keep Country K L

. foreach i in Country {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }

. 
. drop K L

. save dtsr_fluctuations.dta, replace
(note: file dtsr_fluctuations.dta not found)
file dtsr_fluctuations.dta saved

. 
. merge 1:1 Country using inv_fluctuations.dta
(note: variable Country was str14, now str29 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           217
        from master                        22  (_merge==1)
        from using                        195  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import excel "./stockdata/stockfluctuations_1.xlsx", firstrow clear
(7 vars, 195 obs)

. save inv_fluctuations.dta, replace
file inv_fluctuations.dta saved

. 
. *Datastream data - For Loop generating % change between 06/03 and 13/03
. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. *generating WHO crash - can adjust this for loop in the future to generate % drop in week of first case, etc. 
. keep Country K L

. foreach i in Country {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }

. 
. drop K L

. save dtsr_fluctuations.dta, replace
file dtsr_fluctuations.dta saved

. 
. merge 1:1 Country using inv_fluctuations.dta
(note: variable Country was str14, now str29 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           175
        from master                         1  (_merge==1)
        from using                        174  (_merge==2)

    matched                                21  (_merge==3)
    -----------------------------------------

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. import excel "./stockdata/stockfluctuations_1.xlsx", firstrow clear
(7 vars, 195 obs)

. save inv_fluctuations.dta, replace
file inv_fluctuations.dta saved

. 
. *Datastream data - For Loop generating % change between 06/03 and 13/03
. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. *generating WHO crash - can adjust this for loop in the future to generate % drop in week of first case, etc. 
. keep Country K L

. foreach i in Country {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }

. 
. drop K L

. save dtsr_fluctuations.dta, replace
file dtsr_fluctuations.dta saved

. 
. merge 1:1 Country using inv_fluctuations.dta
(note: variable Country was str14, now str29 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           175
        from master                         1  (_merge==1)
        from using                        174  (_merge==2)

    matched                                21  (_merge==3)
    -----------------------------------------

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD6098_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic/Data"
C:\Users\gauta\Documents\GitHub\pandemic\Data

. 
. //GHSI DATA (X1a)
. import excel "./GHSI_2019_data.xlsx", sheet("Sheet2") firstrow clear
(20 vars, 196 obs)

. drop J K L M N O P Q R S T U

. 
. rename Overall GHSI_Overall

. rename D GHSI_prev

. rename E GHSI_det

. rename F GHSI_resp

. rename G GHSI_hea_sec

. rename H GHSI_commit

. rename I GHSI_risk

. 
. save ghsi.dta, replace
file ghsi.dta saved

. 
. //looking for outliers/inspecting data
. sum 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     Country |          0
GHSI_Overall |        196        40.2    14.47817       16.2       83.5
   GHSI_prev |        196     34.7551    16.87089        1.9       83.1
    GHSI_det |        196    41.88469    23.75211        2.7       98.2
   GHSI_resp |        196    38.43418    15.08093       11.3       91.9
-------------+---------------------------------------------------------
GHSI_hea_sec |        196    26.42755    16.83055         .3       73.8
 GHSI_commit |        196    48.48469    12.60972       23.3       85.3
   GHSI_risk |        196    55.03112    16.16126       15.9       87.9

. inspect 

Country:  Country                               Number of Observations
-----------------                      ---------------------------------------
                                             Total      Integers   Nonintegers
|                            Negative            -             -             -
|                            Zero                -             -             -
|                            Positive            -             -             -
|                                      -----------   -----------   -----------
|                            Total               -             -             -
|                            Missing           196
+----------------------                -----------
.             -9.0e+307                        196
   (0 unique value)

GHSI_Overall:  Overall                          Number of Observations
----------------------                 ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|  #   #                     Positive          196            23           173
|  #   #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            23           173
|  #   #   #   #   .         Missing             -
+----------------------                -----------
16.2               83.5                        196
(More than 99 unique values)

GHSI_prev:  1                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|      #                     Positive          196            30           166
|      #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            30           166
|  #   #   #   #   .         Missing             -
+----------------------                -----------
1.9                83.1                        196
(More than 99 unique values)

GHSI_det:  2                                    Number of Observations
------------                           ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #   #                 Zero                -             -             -
|  #   #   #                 Positive          196            28           168
|  #   #   #   #                       -----------   -----------   -----------
|  #   #   #   #             Total             196            28           168
|  #   #   #   #   #         Missing             -
+----------------------                -----------
2.7                98.2                        196
(More than 99 unique values)

GHSI_resp:  3                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|  #   #   #                 Positive          196            18           178
|  #   #   #                           -----------   -----------   -----------
|  #   #   #                 Total             196            18           178
|  #   #   #   #   .         Missing             -
+----------------------                -----------
11.3               91.9                        196
(More than 99 unique values)

GHSI_hea_sec:  4                                Number of Observations
----------------                       ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #   #                     Zero                -             -             -
|  #   #                     Positive          196            24           172
|  #   #   #                           -----------   -----------   -----------
|  #   #   #   #             Total             196            24           172
|  #   #   #   #   #         Missing             -
+----------------------                -----------
.3                 73.8                        196
(More than 99 unique values)

GHSI_commit:  5                                 Number of Observations
---------------                        ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|      #   #                 Zero                -             -             -
|      #   #                 Positive          196            22           174
|  #   #   #                           -----------   -----------   -----------
|  #   #   #   #             Total             196            22           174
|  #   #   #   #   .         Missing             -
+----------------------                -----------
23.3               85.3                        196
(More than 99 unique values)

GHSI_risk:  6                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|          #                 Zero                -             -             -
|      #   #   #             Positive          196            21           175
|      #   #   #                       -----------   -----------   -----------
|      #   #   #   #         Total             196            21           175
|  #   #   #   #   #         Missing             -
+----------------------                -----------
15.9               87.9                        196
(More than 99 unique values)

. 
. //STOCK MARKET DATA (Y)
. 
. *stock market data from Investing.com
. import excel "./stockdata/stockfluctuations_1.xlsx", firstrow clear
(7 vars, 195 obs)

. save inv_fluctuations.dta, replace
file inv_fluctuations.dta saved

. 
. *Datastream data - For Loop generating % change between 06/03 and 13/03
. import excel "./stockdata/DataStream/data/stock_ts.xlsx", sheet(Table1) firstrow clear
(24 vars, 22 obs)

. 
. *generating WHO crash - can adjust this for loop in the future to generate % drop in week of first case, etc. 
. keep Country K L

. foreach i in Country {
  2.         gen dstr_WHO = ((L - K)/K)*100
  3.         }

. 
. drop K L

. save dtsr_fluctuations.dta, replace
file dtsr_fluctuations.dta saved

. 
. merge 1:1 Country using inv_fluctuations.dta
(note: variable Country was str14, now str29 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           175
        from master                         1  (_merge==1)
        from using                        174  (_merge==2)

    matched                                21  (_merge==3)
    -----------------------------------------

. drop if _merge !=3
(175 observations deleted)

. drop _merge

. save fluctuations.dta, replace
file fluctuations.dta saved

. 
. merge 1:1 Country using ghsi.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                           175
        from master                         0  (_merge==1)
        from using                        175  (_merge==2)

    matched                                21  (_merge==3)
    -----------------------------------------

. drop if _merge !=3
(175 observations deleted)

. drop _merge

. save pandemic.dta, replace
file pandemic.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. //only downloaded/merged x and y thus far, for a subsample of countries. No control variables yet.
. 
. //todo: download subsample of stock market data when the pandemic hit. 
.         //first, download time series stock market excel sheets for Jan/Feb/March/April each country. Have this dataset available (so that we can edit the lags if needed in next step) - DONE
.                 //then cut in STATA - for each country, 4 variables: stock market performance on the day it hit, 1 week, 2 weeks and 1 month after. Dates: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7068164/
.                         //then merge into GHSI data.
.         
.         //pandemic timeline: do a variable of stock returns following: WHO pandemic announcement (11th March) + 2 day and 1 week lags. For lags - do average of daily fluctuations or? Probably. Could do sum of variation (don't think this would have an
>  effect).
.         //then also do 1st case in country + lags.
.         
. //regression: % change_i = a + bGHSI_i + u_i. No control variables yet; dependent variable varies depending on dates.
. 
end of do-file

