--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\gauta\Documents\GitHub\pandemic\pandemic.log
  log type:  text
 opened on:   9 Oct 2021, 16:14:06

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. *Analysis 5: dstr_WHO ~ WB Hospital Beds. (30/09/21).
. use "./Data/pandemic_master.dta", clear

. keep Country id dstr_WHO dstr_WHO2 WB_hb_p1000

. drop if WB_hb_p1000 > 15
(48 observations deleted)

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. gen pos = 3

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. set scheme plottig

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. replace pos = 12 if id=="NLD"
(1 real change made)

. replace pos = 2 if id=="VNM"
(1 real change made)

. replace pos = 4 if id=="TUR"
(1 real change made)

. replace pos = 6 if id=="NZL"
(1 real change made)

. replace pos = 12 if id=="POL"
(1 real change made)

. replace pos = 1 if id=="HRV"
(1 real change made)

. replace pos = 2 if id=="DEU"
(1 real change made)

. replace pos = 8 if id=="ESP"
(1 real change made)

. replace pos = 12 if id=="SWE"
(1 real change made)

. replace pos = 6 if id=="MEX"
(1 real change made)

. replace pos = 4 if id=="ISR"
(1 real change made)

. replace pos = 12 if id=="KOR"
(2 real changes made)

. replace pos = 9 if id== "GBR"
(1 real change made)

. 
. twoway scatter dstr_WHO2 WB_hb_p1000, title({bf:Hospital Beds and Stock Index Performance:} {it:6th March - 20th March}, size(8pt)) xtitle("Hospital Beds/1000") ytitle(
> "Stock Fluctuation between" "06/03/20 and 20/03/20") mlabel(id) msize(1pt) mlabsize(tiny) mlabv(pos) legend(off) || lfit dstr_WHO2 WB_hb_p1000, lcolor(black) 

. 
. graph save "C:/Users/gauta/Documents/GitHub/pandemic/figures/scatterplots/pres_1_1.gph", replace
(file C:/Users/gauta/Documents/GitHub/pandemic/figures/scatterplots/pres_1_1.gph saved)

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. use "./Data/pandemic_master.dta", clear

. keep Country id dstr_WHO dstr_WHO2 WHO_2018_HE_GDP

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. gen pos = 3

. replace pos = 2 if id=="DEU"
(1 real change made)

. replace pos = 6 if id=="SGP"
(1 real change made)

. replace pos = 6 if id=="NZL"
(1 real change made)

. replace pos = 6 if id=="AUT"
(1 real change made)

. replace pos = 2 if id=="BEL"
(1 real change made)

. replace pos = 9 if id=="JPN"
(1 real change made)

. 
. 
. scatter dstr_WHO2 WHO_2018_HE_GDP, title({bf:Health Expenditure and Stock Index Performance:} {it:6th March - 20th March}, size(8pt)) xtitle("Health Expenditure as % of
>  GDP") ytitle("Stock Fluctuation between" "06/03/20 and 20/03/20") mlabel(id) msize(1pt) mlabsize(tiny) mlabv(pos) legend(off)|| lfit dstr_WHO2 WHO_2018_HE_GDP, lcolor(
> black)

. 
. graph save "C:/Users/gauta/Documents/GitHub/pandemic/figures/scatterplots/pres_1_2.gph", replace
(file C:/Users/gauta/Documents/GitHub/pandemic/figures/scatterplots/pres_1_2.gph saved)

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. asdoc reg dstr_WHO2 WHO_2018_HE_GDP, robust replace dec(5)

Linear regression                               Number of obs     =         34
                                                F(1, 32)          =       0.30
                                                Prob > F          =     0.5873
                                                R-squared         =     0.0117
                                                Root MSE          =     .07345

---------------------------------------------------------------------------------
                |               Robust
      dstr_WHO2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
WHO_2018_HE_GDP |   .0028513   .0052009     0.55   0.587    -.0077426    .0134452
          _cons |  -.2181191    .048071    -4.54   0.000    -.3160366   -.1202016
---------------------------------------------------------------------------------
(note: file Myfile.doc not found)
Click to Open File:  Myfile.doc

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. use "./Data/pandemic_master.dta", clear

. keep Country id dstr_WHO dstr_WHO2 WB_hb_p1000

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. asdoc reg dstr_WHO2 WB_hb_p1000, robust replace dec(5) //n = 32, negative and insignificant.

Linear regression                               Number of obs     =         34
                                                F(1, 32)          =       1.26
                                                Prob > F          =     0.2697
                                                R-squared         =     0.0148
                                                Root MSE          =     .07333

------------------------------------------------------------------------------
             |               Robust
   dstr_WHO2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 WB_hb_p1000 |   .0031452      .0028     1.12   0.270    -.0025581    .0088485
       _cons |  -.2069098   .0210798    -9.82   0.000     -.249848   -.1639715
------------------------------------------------------------------------------
(note: file Myfile.doc not found)
Click to Open File:  Myfile.doc

. 
end of do-file

. do "C:\Users\gauta\AppData\Local\Temp\STD1d08_000000.tmp"

. clear

. cd "C:/Users/gauta/Documents/GitHub/pandemic"
C:\Users\gauta\Documents\GitHub\pandemic

. capture log close
